vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC142_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXC142_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXC142_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXC142.condition_id" category="linkerScript" attr="config" name="devices/MCXC142/arm/MCXC142_flash.scf" version="1.0.0" projectpath="MCXC142/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXC142.condition_id" category="linkerScript" attr="config" name="devices/MCXC142/arm/MCXC142_ram.scf" version="1.0.0" projectpath="MCXC142/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXC142.condition_id" category="linkerScript" attr="config" name="devices/MCXC142/gcc/MCXC142_flash.ld" version="1.0.0" projectpath="MCXC142/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXC142.condition_id" category="linkerScript" attr="config" name="devices/MCXC142/gcc/MCXC142_ram.ld" version="1.0.0" projectpath="MCXC142/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXC142.condition_id" category="linkerScript" attr="config" name="devices/MCXC142/iar/MCXC142_flash.icf" version="1.0.0" projectpath="MCXC142/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXC142.condition_id" category="linkerScript" attr="config" name="devices/MCXC142/iar/MCXC142_ram.icf" version="1.0.0" projectpath="MCXC142/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXC142" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXC142</description>
      <files>
        <file category="header" attr="config" name="devices/MCXC142/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC142/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXC142/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC142/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXC142/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC142/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXC142/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC142/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXC142/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXC142_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MCXC142/iar/startup_MCXC142.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MCXC142/gcc/startup_MCXC142.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MCXC142/arm/startup_MCXC142.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXC142_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXC142_system</description>
      <files>
        <file category="sourceC" name="devices/MCXC142/system_MCXC142.c" projectpath="device"/>
        <file category="header" name="devices/MCXC142/system_MCXC142.h" projectpath="device"/>
        <file category="include" name="devices/MCXC142/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.3.0" condition="driver.adc16.condition_id">
      <description>ADC16 Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC142/drivers/fsl_adc16.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC142/drivers/fsl_adc16.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC142/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.3.1" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC142/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC142/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC142/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp" Cversion="2.0.3" condition="driver.cmp.condition_id">
      <description>CMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC142/drivers/fsl_cmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC142/drivers/fsl_cmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC142/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="GPIO" Csub="gpio_cmsis" Cversion="1.0.0" Capiversion="1.0.0" condition="driver.cmsis_gpio.condition_id">
      <description>GPIO CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXC142/cmsis_drivers/fsl_gpio_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC142/cmsis_drivers/fsl_gpio_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC142/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="i2c_cmsis" Cversion="2.2.0" Capiversion="2.3.0" condition="driver.cmsis_i2c.condition_id">
      <description>I2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXC142/cmsis_drivers/fsl_i2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC142/cmsis_drivers/fsl_i2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC142/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.7.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXC142/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC142/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC142/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="spi_cmsis" Cversion="2.3.0" Capiversion="2.2.0" condition="driver.cmsis_spi.condition_id">
      <description>SPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXC142/cmsis_drivers/fsl_spi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC142/cmsis_drivers/fsl_spi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC142/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="uart_cmsis" Cversion="2.2.0" Capiversion="2.3.0" condition="driver.cmsis_uart.condition_id">
      <description>UART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXC142/cmsis_drivers/fsl_uart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC142/cmsis_drivers/fsl_uart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC142/cmsis_drivers/"/>
      </files>
    </component>
